# taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "AdoptOpenJDK/openjdk"
tap "epk/epk"

# common binaries
brew "ack"
brew "mackup"
brew "trash"
brew "zsh"

# development binaries
cask "adoptopenjdk14"
brew "bat"
brew "exercism"
brew "git"
cask "google-cloud-sdk"
brew "httpie"
brew "jenv"
brew "maven"
cask "ngrok"
brew "node"

# common apps
cask "alfred"
cask "appcleaner"
cask "dropbox"
cask "forklift"
cask "google-chrome"
cask "rectangle"
cask "slack"
cask "spotify"
cask "transmission"
cask "vanilla"
cask "vlc"

# development apps
cask "hyper"
cask "insomnia"
cask "intellij-idea-ce"
cask "sourcetree"

# utilities
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlstephen"
cask "quicklook-json"

# mac app store
#mas "ColorSlurp", id: 1287239339
mas "LastPass", id: 926036361
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "The Unarchiver", id: 425424353

#fonts
cask "font-sf-mono-nerd-font"
