# taps
tap "homebrew/bundle"
tap "homebrew/cask"

# binaries
brew "zsh"
brew "bat"
brew "ack"
brew "trash"
brew "httpie"
brew "git"
brew "mackup"

# development
brew "node"

# apps
cask "forklift"
cask "vlc"
cask "appcleaner"
cask "the-unarchiver"
cask "rectangle"
cask "alfred"
cask "lastpass"
cask "slack"
cask "sourcetree"
cask "insomnia"
cask "google-chrome"